app/views/users/index.html.erb

            <small>
              <%= pluralize(user.articles.count, "article") if user.articles %>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]