app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Title of article"], ["description", "To test user"], ["created_at", "2019-11-29 07:32:14.657560"], ["updated_at", "2019-11-29 07:32:14.657560"], ["user_id", 1]]
---
    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Gwepura - Fifth article"], ["updated_at", "2019-11-29 11:07:53.015573"], ["id", 16]]
---
    def update
        if @article.update(article_params)