app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "anesu3"], ["email", "anesu3@test.com"], ["updated_at", "2019-11-29 09:16:27.765054"], ["id", 5]]

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 9]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]